// Переменная
// 1 способ объявления переменной
// let number = 5; // создали коробочку- let,
//                 // дали название- number,
//                 // положили в коробочку -5.

// // 2 способ объявления переменной
// const leftBorderWidth = 1;

// number = 10;      // переопределение переменной
// console.log(number);

// В основном применяется const.

// Пример как можно менять const (константу)
/*
const obj = {
   a: 50
}
obj.a = 10;       // меняем значение константы
console.log(obj); // вывод прямых констант не бывает
*/

// 3 способ объявления переменной
// устаревшее название переменной - var (лучше не применять)
// (при let переменная существует после того, когда была объявлена)

// console.log(name);      // хойстинг- всплытие переменных
// var name = 'Ivan';

// Видимость ограничена блоком или фигурными скобками
// {
//    let result = 50;
// }
// console.log(result);

